{"_id":{"$oid":"628dcc1a23dd8e5cd4507a1e"},"Title":"The Martian","Description":"An astronaut becomes stranded on Mars after his team assume him dead, and must rely on his ingenuity to find a way to signal to Earth that he is alive and can survive until a potential rescue.","Genre":{"Name":"Sci-Fi","Description":"A film genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, spacecraft, robots, cyborgs, interstellar travel or other technologies."},"Director":{"Name":"Ridley Scott","Bio":"Sir Ridley Scott is an English film director and producer. He has directed, among others, the science fiction films Alien, Blade Runner and The Martian, the road crime film Thelma & Louise, the historical drama film Gladiator, and the war film Black Hawk Down.","Birth":"1937"},"ImagePath":"https://www.imdb.com/title/tt3659388/mediaviewer/rm1391324160/?ref_=tt_ov_i","Featured":true}
{"_id":{"$oid":"628dcd2923dd8e5cd4507a1f"},"Title":"Predator","Description":"A team of commandos on a mission in a Central American jungle find themselves hunted by an extraterrestrial warrior.","Genre":{"Name":"Action","Description":"A film genre where action sequences, such as fighting, stunts, car chases or explosions, take precedence over elements like characterization or complex plotting. The action typically involves individual efforts on the part of the hero, in contrast with most war films."},"Director":{"Name":"John McTiernan","Bio":"John Campbell McTiernan Jr. is an American filmmaker. He is best known for his action films, especially Predator, Die Hard, and The Hunt for Red October.","Birth":"1951"},"ImagePath":"https://www.imdb.com/title/tt0093773/mediaviewer/rm35588864/?ref_=tt_ov_i","Featured":true}
{"_id":{"$oid":"628dcda723dd8e5cd4507a20"},"Title":"Dune","Description":"A noble family becomes embroiled in a war for control over the galaxys most valuable asset while its heir becomes troubled by visions of a dark future.","Genre":{"Name":"Drama","Description":"The drama genre features stories with high stakes and a lot of conflicts. They're plot-driven and demand that every character and scene move the story forward."},"Director":{"Name":"Denis Villeneuve","Bio":"Denis Villeneuve is a French Canadian film director and writer. He was born in 1967, in Trois-Rivières, Québec, Canada. He started his career as a filmmaker at the National Film Board of Canada.","Birth":"1967"},"ImagePath":"https://www.imdb.com/title/tt1160419/mediaviewer/rm2910452737/https://www.imdb.com/title/tt0093773/mediaviewer/rm35588864/?ref_=tt_ov_i","Featured":true}
{"_id":{"$oid":"628dce3a23dd8e5cd4507a21"},"Title":"The Gentlemen","Description":"An American expat tries to sell off his highly profitable marijuana empire in London, triggering plots, schemes, bribery and blackmail in an attempt to steal his domain out from under him.","Genre":{"Name":"Action","Description":"A film genre where action sequences, such as fighting, stunts, car chases or explosions, take precedence over elements like characterization or complex plotting. The action typically involves individual efforts on the part of the hero, in contrast with most war films."},"Director":{"Name":"Guy Ritchie","Bio":"Guy Ritchie was born in Hatfield, Hertfordshire, UK on September 10, 1968. After watching Butch Cassidy and the Sundance Kid (1969) as a child, Guy realized that what he wanted to do was make films. He never attended film school, saying that the work of film school graduates was boring and unwatchable. At 15 years old, he dropped out of school and in 1995, got a job as a runner, ultimately starting his film career. He quickly progressed and was directing music promos for bands and commercials by 1995.","Birth":"1968"},"ImagePath":"https://www.imdb.com/title/tt8367814/mediaviewer/rm1937148929/","Featured":true}
{"_id":{"$oid":"628dcec023dd8e5cd4507a22"},"Title":"The Dark Knight","Description":" UPDATE With the help of allies Lt. Jim Gordon and DA Harvey Dent, Batman has been able to keep a tight lid on crime in Gotham City. But when a vile young criminal calling himself the Joker suddenly throws the town into chaos, the caped Crusader begins to tread a fine line between heroism and vigilantism.","Genre":{"Name":"Action","Description":"A film genre where action sequences, such as fighting, stunts, car chases or explosions, take precedence over elements like characterization or complex plotting. The action typically involves individual efforts on the part of the hero, in contrast with most war films."},"Director":{"Name":"Christopher Nolan","Bio":"Best known for his cerebral, often nonlinear, storytelling, acclaimed writer-director Christopher Nolan was born on July 30, 1970, in London, England. Over the course of 15 years of filmmaking, Nolan has gone from low-budget independent films to working on some of the biggest blockbusters ever made.","Birth":"1970"},"ImagePath":"https://www.imdb.com/title/tt0468569/mediaviewer/rm4023877632/","Featured":true}
{"_id":{"$oid":"628dcf5f23dd8e5cd4507a23"},"Title":"Deadpool","Description":"A wisecracking mercenary gets experimented on and becomes immortal but ugly, and sets out to track down the man who ruined his looks.","Genre":{"Name":"Comedy","Description":"Comedies are light-hearted dramas, crafted to amuse, entertain, and provoke enjoyment. The comedy genre humorously exaggerates the situation, the language, action, and characters."},"Director":{"Name":"Tim Miller","Bio":"Tim Miller is an American animator, film director, creative director and visual effects artist. He was nominated for the Academy Award for Best Animated Short Film for the work on his short animated film Gopher Broke. He made his directing debut with Deadpool. Miller is also famous for creating opening sequences of The Girl with the Dragon Tattoo and Thor: The Dark World","Birth":"1964"},"ImagePath":"https://www.imdb.com/title/tt1431045/mediaviewer/rm351021568/","Featured":true}
{"_id":{"$oid":"628dd00f23dd8e5cd4507a24"},"Title":"No Country For Old Men","Description":"Violence and mayhem ensue after a hunter stumbles upon a drug deal gone wrong and more than two million dollars in cash near the Rio Grande.","Genre":{"Name":"Thriller","Description":"Thrillers are characterized and defined by the moods they elicit, giving viewers heightened feelings of suspense, excitement, surprise, anticipation and anxiety."},"Director":{"Name":"Coen Brothers","Bio":"The younger brother of Joel, Ethan Coen is an Academy Award and Golden Globe winning writer, producer and director coming from small independent films to big profile Hollywood films. He was born on September 21, 1957 in Minneapolis, Minnesota. In some films of the brothers- Ethan & Joel wrote, Joel directed and Ethan produced - with both editing under the name of Roderick Jaynes; but in 2004 they started to share the three main duties plus editing. Each film bring its own quality, creativity, art and with one project more daring the other. Joel Daniel Coen is an American filmmaker who regularly collaborates with his younger brother Ethan. They made Raising Arizona, Barton Fink, Fargo, The Big Lebowski, True Grit, O Brother Where Art Thou?, Burn After Reading, A Serious Man, Inside Llewyn Davis, Hail Caesar and other projects. Joel married actress Frances McDormand in 1984 and had an adopted son.","Birth":"1957"},"ImagePath":"https://www.imdb.com/title/tt0477348/mediaviewer/rm1263244032/","Featured":true}
{"_id":{"$oid":"628dd1f023dd8e5cd4507a25"},"Title":"Knives Out","Description":"A detective investigates the death of the patriarch of an eccentric, combative family.","Genre":{"Name":"Crime","Description":"A film genre inspired by and analogous to the crime fiction literary genre. Films of this genre generally involve various aspects of crime and its detection."},"Director":{"Name":"Rian Johnson","Bio":"Rian Johnson was born in Maryland and at a young age his family moved to San Clemente, California, where he was raised. He is a director, writer, and musician, among other areas of expertise.","Birth":"1973"},"ImagePath":"https://www.imdb.com/title/tt8946378/mediaviewer/rm2569376769/","Featured":true}
{"_id":{"$oid":"628dd3bd23dd8e5cd4507a26"},"Title":"Ready Player One","Description":"When the creator of a virtual reality called the OASIS dies, he makes a posthumous challenge to all OASIS users to find his Easter Egg, which will give the finder his fortune and control of his world","Genre":{"Name":"Sci-Fi","Description":"A film genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, spacecraft, robots, cyborgs, interstellar travel or other technologies."},"Director":{"Name":"Steven Spielberg","Bio":"Steven Allan Spielberg is an American film director, producer, and screenwriter. He began his career in the New Hollywood era and is currently the most commercially successful director of all time.","Birth":"1946"},"ImagePath":"https://www.imdb.com/title/tt1677720/mediaviewer/rm4286860032/?ref_=tt_ov_i","Featured":true}
{"_id":{"$oid":"628dd40c23dd8e5cd4507a27"},"Title":"Interstellar","Description":"A team of explorers travel through a wormhole in space in an attempt to ensure humanitys survival.","Genre":{"Name":"Sci-Fi","Description":"A film genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, spacecraft, robots, cyborgs, interstellar travel or other technologies."},"Director":{"Name":"Christopher Nolan","Bio":"Best known for his cerebral, often nonlinear, storytelling, acclaimed writer-director Christopher Nolan was born on July 30, 1970, in London, England. Over the course of 15 years of filmmaking, Nolan has gone from low-budget independent films to working on some of the biggest blockbusters ever made.","Birth":"1970"},"ImagePath":"https://www.imdb.com/title/tt0816692/mediaviewer/rm4043724800/?ref_=tt_ov_i","Featured":true}
